import random
import subprocess
import time

image_name = "youtube-crawler:latest"  # 실행할 Docker 이미지
desired_count = 20  # 유지하려는 컨테이너의 수
ELASTICSEARCH_HOST = "13.125.43.3"
ELASTICSEARCH_PORT = 9200
SYSLOG_HOST = "13.125.43.3"
SYSLOG_PORT = 514
DISCOED_WEBHOOK_URL = ""
MODE = "prod"

persona_list = [
    ["스마트팩토리", "스마트팩토리,사물인터넷,인공지능,빅데이터"],
    ["런치타임", "점심메뉴,데일리밀박스,반찬,도시락"],
    ["슈슈요리조리", "간편요리,가정식,한끼요리,쉬운레시피,홈쿡"],
    ["좋은생각", "긍정성,자기계발,행복,치유,성장"],
    ["테크놀로지스트", "전자제품,제품리뷰,스마트홈,기술트렌드,로봇,메타버스"],
    ["테크마스터", "최신기술,반도체,하드웨어,센서"],
    ["두뇌활성화", "기억법,집중력강화,인지능력,퀴즈,퍼즐"],
    ["나폴리맘", "이민,언어교육,문화차이극복,정체성"],
    ["스텝별댄스", "댄스,춤,안무,발레,스트레칭"],
    ["한솥도시락", "도시락,점심메뉴,한끼요리,반찬,데일리밀박스"],
    ["책과문학애호가", "베스트셀러,문학작품,독서,북리뷰,작가인터뷰"],
    ["솔로탱이의일기", "독신,1인가구,배낭여행,혼밥"],
    ["마블링세상", "공예,레진아트,폴리머클레이,입체프린팅"],
    ["마인드풀생각", "마인드풀니스,명상,자기성찰,힐링"],
    ["맛팡팡", "먹방,음식리뷰,코리아푸드,직접만든음식"],
    ["뷰티블리썸", "메이크업튜토리얼,뷰티제품리뷰,성형정보,헤어스타일"],
    ["띵작대디", "목공예,집수리,공구리뷰,인테리어아이디어"],
    ["예술과창작", "미술작품,조각,창작프로세스,전시회,아트마켓"],
    ["펫츠둥이", "강아지놀이,강아지훈련,펫샵,동물병원"],
    ["고양이애호가", "고양이종류,돌봄팁,반려동물용품,고양이산책"],
    ["오감댄스", "발레,무용,스트레칭,에어로빅,댄스스포츠"],
    ["꿀꿀홈베이킹", "베이킹,디저트,케이크,마카롱,쿠키"],
    ["비건화장꾼", "비건화장품,동물권,동물실험반대,동물보호"],
    ["빈티지디제인", "빈티지인테리어,업사이클,핸드메이드"],
    ["스냅해커", "해킹,사이버보안,디지털포렌식,보안리뷰,암호화폐"],
    ["스포츠연애가", "스포츠팀,경기일정,스포츠뉴스,응원가,선수인터뷰"],
    ["플랜티타임", "실내정원,텃밭가꾸기,꽃꽂이,원예,정원가꾸기"],
    ["꿈꾸는아이", "유아교육,창의력교육,놀이활동,아동동화,유아영어"],
    ["밥아빠", "아빠육아,부성경험기,가족활동,엄마돕기"],
    ["모험왕마누", "등산,캠핑,생태관찰,환경보호,야생,국립공원탐방"],
    ["엔터테인먼트중독", "영화,드라마,콘서트,스타소식,공연리뷰,인터뷰"],
    ["여행열정가", "해외여행,외국어,어드벤처,가족여행"],
    ["영어킹", "영어공부,회화,발음교정,해외유학,시험대비"],
    ["영화비평가", "영화리뷰,영화평론,개봉작분석,영화이론,관객반응"],
    ["굿모닝요가", "요가,명상,스트레칭,호흡요법,비욘드요가,필라테스"],
    ["맘스쿠킹클래스", "요리교실,밀키트,홈쿠킹,베이킹클래스,아이밥만들기"],
    ["와이너", "안주,와인바,쉐프인터뷰,와인페어링"],
    ["요리마스터", "푸드스타일링,쿠킹클래스,레스토랑리뷰,도구소개"],
    ["피트니스프로", "운동루틴,식단,피트니스,헬스장"],
    ["또똣동", "유아교육,놀이활동,창의력교육,동화읽기,상상놀이"],
    ["귀여운똘이", "육아일상,양육정보,모유수유,이유식,유아발달"],
    ["음악매니아", "음악장르,음악가인터뷰,공연정보,악기연주법,뮤직비디오"],
    ["일렉트로닉", "일렉트로닉,클럽음악,댄스음악,뮤직페스티벌,디제잉"],
    ["브이로거", "브이로그,일상,일기,기록,챌린지"],
    ["조커쵸크", "일상유머,코미디스케치,개그콘텐츠,예능,팟캐스트"],
    ["오늘도잘살아보자", "인생교훈,자기계발서적,행복연구,리딩클럽,행복수업"],
    ["자동차매니아", "자동차브랜드,레이싱,자동차튜닝,오토바이,경주분석"],
    ["자연탐험가", "등산,생태관찰,환경보호,사파리,국립공원탐방"],
    ["똑똑하게투자", "주식,재테크,주식분석,부동산,가상자산,자산관리"],
    ["골목길킹", "맛집탐방,로컬푸드,동네가게,숨은맛집,먹거리추천"],
    ["차돌바위가이드", "로컬여행,지역명소,맛집,로컬투어,숨은여행코스"],
    ["아트인하우스", "인테리어,집꾸미기,가구배치,소품추천,리폼"],
    ["청춘불편한진실", "청년실업,일자리,주거문제,구직팁,해외취업"],
    ["고백왕", "연애,고백,문화,데이트코스,선물아이디어"],
    ["모닝커피", "커피,카페투어,원두추천,커피맛집"],
    ["클래식맘", "클래식,오페라,연주회,악기연주법,음악이론"],
    ["재테크대학", "주식,부동산,정보금융,비트코인,스타트업투자"],
    ["미스터리더", "팟캐스트,오디오북,스토리텔링,크리에이터인터뷰,제작노하우"],
    ["패션스타일러", "패션트렌드,의류브랜드,스타일링,메이크업,빈티지패션"],
    ["곤충샵", "곤충소개,해충,희귀곤충,모기,퇴치법"],
    ["포토샵신학생", "포토샵,그래픽디자인,포스터,포토샵팁"],
    ["자연속의그림자", "풍경사진,야경,여행,사진구도,카메라리뷰"],
    ["달려라김치만두", "한식,김치,젓갈,한식요리법,계절음식"],
    ["환경지킴이", "재활용,친환경생활,지속가능에너지,기후행동,미세먼지"],
    ["수면과학", "백색소음,수면유도,호흡법,수면음악"],
    ["K-POP팬", "케이팝,아티스트분석,아이돌,팬커뮤니티,댄스"],
    ["드라마리뷰어", "드라마리뷰,배우인터뷰,에피소드해설,요약본,몰아보기"],
    ["예능프로그램애호가", "예능,하이라이트,베스트클립,리액션,예능레전드"],
    ["강아지훈련전문가", "강아지훈련,행동교정,반려견,애완동물관리,애견훈련사"],
    ["히스토리텔러", "역사,한국사,히스토리,역사강의,역사이야기"],
    ["심리카운셀러", "심리학,상담,심리치료사,심리테스트,검사"],
    ["리걸어드바이저", "법률,상담,법률정보,변호사,소송,법률자문"],
    ["경제교육가", "경제원리,이론,경제사,경제교육,경제학자"],
    ["조경디자이너", "조경,디자인,정원,조경아이디어,조경디자인팁"],
    ["프로축구해설가", "경기분석,축구,축구해설,하이라이트,해외축구"],
    ["야구엔터테이너", "야구하이라이트,선수인터뷰,사회인야구,야구직관,"],
    ["빈티지패션컬렉터", "빈티지패션,스타일링팁,쇼핑가이드,빈티지아이템"],
    ["패션DIY크리에이터", "패션,헌옷,리폼,패션재활용,옷만들기"],
    ["코딩마스터", "코딩,프로그래밍,튜토리얼,개발팁,프로그래밍언어"],
    ["스타트업핵심인물", "스타트업,비즈니스,창업,기업가치,투자"],
    ["음악프로듀서", "음악제작,프로듀싱팁,장비리뷰,음악프로듀서"],
    ["인디음악애호가", "인디음악,음악추천,아티스트인터뷰,음악리뷰"],
    ["IT트렌드워처", "정보기술트렌드,기술뉴스,산업동향,최신기술"],
    ["게임개발자", "게임개발,인디게임,게임디자인,개발자,프로그래밍"],
    ["건축마스터", "건축,디자인,건축가,건축디자인,건축물"],
    ["백패커가이드", "백패킹,저렴한여행,배낭여행,숙박추천,가성비"],
    ["비건요리전문가", "비건,샐러드,식재료,채식,요리팁"],
    ["러닝열정가", "러닝,조깅,러닝팁,러닝화,마라톤"],
    ["보컬코치", "노래,가이드,보컬,트레이닝,레슨,보컬트레이너"],
    ["스트리트패션리스타", "스트리트패션,트렌드,옷조합,패션리뷰,브랜드"],
    ["캠핑마스터", "캠핑,아웃도어,캠핑가이드,캠핑팁,캠핑장비"],
    ["판타지사이언티스트", "공상과학,이론,사이언스,이야기"],
    ["테이블세팅아티스트", "테이블세팅,홈파티,디너파티,인테리어,세팅아이디어"],
    ["드론마스터", "드론,비디오촬영,촬영팁,드론비디오,비디오편집"],
    ["문화탐험가", "세계문화,역사적장소,예술작품,문화탐험,여행가이드"],
    ["재즈열정가", "재즈음악,아티스트소개,재즈공연,음악감상"],
    ["미니멀리스트", "미니멀리즘,미니멀라이프,미니멀,일상,라이프스타일"],
    ["수학마스터", "수학문제해설,수학공식,공부팁,수학학습"],
    ["럭셔리트래블러", "럭셔리여행,고급호텔,호텔식당,브이로그"],
    ["아스트로노머", "천체관측,별,우주,천문학"],
]


def get_running_containers(image_name):
    """특정 이미지로 실행 중인 컨테이너의 ID를 가져옵니다."""
    try:
        output = subprocess.check_output(
            [
                "docker",
                "ps",
                "--filter",
                f"ancestor={image_name}",
                "--format",
                "{{.ID}}",
            ]
        )
        return output.decode("utf-8").splitlines()
    except subprocess.CalledProcessError:
        return []


def start_container(image_name):
    """새로운 컨테이너를 비동기적으로 시작합니다."""
    name, keywords = random.choice(persona_list)

    cmd = []
    args = [
        "docker run",
        "--rm",
        # "--platform linux/amd64",
        f"-e MODE={MODE}",
        f"-e ELASTICSEARCH_HOST={ELASTICSEARCH_HOST}",
        f"-e ELASTICSEARCH_PORT={ELASTICSEARCH_PORT}",
        f"-e DISCOED_WEBHOOK_URL={DISCOED_WEBHOOK_URL}",
        "--log-driver=syslog",
        f"--log-opt syslog-address=tcp://{SYSLOG_HOST}:{SYSLOG_PORT}",
        f"{image_name}",
        f"{name}",
        f"{keywords}",
    ]
    for arg in args:
        cmd.extend(arg.split())
    subprocess.Popen(cmd)


while True:
    running_containers = get_running_containers(image_name)
    running_count = len(running_containers)

    if running_count < desired_count:
        for _ in range(desired_count - running_count):
            start_container(image_name)
            running_count += 1
            print(f"새 컨테이너를 시작합니다. 현재 실행 중인 컨테이너 수: {running_count}")
            time.sleep(1)  # 컨테이너가 시작되는 동안 대기

    time.sleep(30)  # 30초 간격으로 상태를 확인
